# -*- org-confirm-babel-evaluate: nil; eval: (setq-local org-structure-template-alist (cons '("hs" . "src haskell :results output") org-structure-template-alist)) -*-
#+STARTUP: overview

book: Programming in Haskell - Graham Hutton

* chapter 1
** 3
#+begin_src haskell :compile yes
  module Main where

  myProduct [] = 1
  myProduct (x:xs) = x * (myProduct xs)

  main :: IO ()
  main =
    putStrLn (show (myProduct [2,3,4]))
#+end_src

#+RESULTS:
: 24

** 4
#+begin_src haskell :compile yes
  module Main where

  qsort []     = []
  qsort (x:xs) = qsort larger ++ [x] ++ qsort smaller
                 where
                   smaller = [a | a <- xs, a <= x]
                   larger  = [b | b <- xs, b > x]

  main :: IO ()
  main =
    putStrLn (show (qsort [2,2,3,1,1]))

#+end_src

#+RESULTS:
| [3 | 2 | 2 | 1 | 1] |
** 5
#+begin_src haskell :compile yes
  module Main where

  qsort []     = []
  qsort (x:xs) = qsort smaller ++ [x] ++ qsort larger
                 where
                   smaller = [a | a <- xs, a < x]
                   larger  = [b | b <- xs, b > x]

  main :: IO ()
  main =
    putStrLn (show (qsort [2,2,3,1,1]))

#+end_src

#+RESULTS:
| [1 | 2 | 3] |

At first I thought it would remove only the duplicates of the first element of the list. But reading the output of the program, I realise that it will remove duplicates of the first element of each sublist processed.

#+begin_example
[2, 2, 3, 1, 1]

[1, 1] ++ [2] ++ [3]

([] ++ [1] ++ []) ++ [2] ++ [3]

[1] ++ [2] ++ [3]

[1, 2] ++ [3]

[1, 2, 3]
#+end_example

* chapter 2
** 3
#+begin_src haskell :compile yes :results output
  module Main where

  n = a `div` (length xs)
    where
      a  = 10
      xs = [1,2,3,4,5]

  main :: IO ()
  main =
    putStrLn (show n)
#+end_src

#+RESULTS:
: 2

* chapter 3
** 3
#+begin_src haskell :results none
  second :: [a] -> a
  swap :: (t1, t2) -> (t2, t1)
  pair x y :: t1 -> t2 -> (t1, t2)
  double x :: Num a => a -> a
  palindrome xs :: [a] -> Bool
  twice :: (t1 -> t2) -> t1 -> t2
#+end_src

** 4
#+begin_src haskell :results output
  second xs = head (tail xs)
  :type second
#+end_src

#+RESULTS:
: second :: [a] -> a

#+begin_src haskell :results output
  swap (x,y) = (y,x)
  :type swap
#+end_src

#+RESULTS:
: swap :: (b, a) -> (a, b)

#+begin_src haskell :results output
  pair x y = (x,y)
  :type pair
#+end_src

#+RESULTS:
: pair :: a -> b -> (a, b)

#+begin_src haskell :results output
  double x = x * 2
  :type double
#+end_src

#+RESULTS:
: double :: Num a => a -> a

#+begin_src haskell :results output
  palindrome xs = reverse xs == xs
  :type palindrome
#+end_src

#+RESULTS:
: palindrome :: Eq a => [a] -> Bool
❌
Forgot to take into account that elements of the list have to have a type that is instance of =Eq=.

#+begin_src haskell :results output
  twice f x = f (f x)
  :type twice
#+end_src

#+RESULTS:
: twice :: (t -> t) -> t -> t

❌
If =f= is going to be applied to =f x=, the type of the output of =f= necessarily has to be the same as the input.

** 5
Function types encode the types of the inputs and outputs. It would be wrong to say that a function that doubles numbers is the same as a function that squares numbers, even though they have the same types and quantity of inputs and outputs. It would also be wrong to say that a function that computes double of numbers by means of multiplication is different from a function that computes double of numbers by means of addition. It would be feasible if the type system could infer the exact elements of the inputs and the exact elements of the output of a function, not only their types.

* chapter 4
** 1
#+begin_src haskell :results output
  halve ns = let n = length ns `div` 2 in (take n ns, drop n ns)

  halve [1,2,3,4,5,6]

  halve [1,2,3]

  :type halve
#+end_src

#+RESULTS:
: ([1,2,3],[4,5,6])
: ([1],[2,3])
: halve :: [a] -> ([a], [a])
** 2
*** a
#+begin_src haskell :results output
  third ns = head (tail (tail ns))

  third [1,2,3]

  :type third
#+end_src

#+RESULTS:
: 3
: third :: [a] -> a

*** b
#+begin_src haskell :results output
  third ns = ns !! 2

  third [4,5,6]

  :type third
#+end_src

#+RESULTS:
: 6
: third :: [a] -> a

*** c
#+begin_src haskell :results output
  third (f:(s:(t:xs))) = t

  third [7,8,9]

  :type third
#+end_src

#+RESULTS:
: 9
: third :: [a] -> a
** 3
*** a
#+begin_src haskell :results output
  safetail ns = if null ns then ns else tail ns

  safetail []

  safetail [1]

  safetail [1,2]

  :type safetail
#+end_src

#+RESULTS:
: []
: []
: [2]
: safetail :: [a] -> [a]

*** b
#+begin_src haskell :results output
  :{
  safetail ns | null ns   = ns
              | otherwise = tail ns
  :}

  safetail []

  safetail [1]

  safetail [1,2]

  :type safetail    
#+end_src

#+RESULTS:
: []
: []
: [2]
: safetail :: [a] -> [a]

*** c
#+begin_src haskell :results output
  :{
  safetail []     = []
  safetail (x:xs) = xs
  :}

  safetail []

  safetail [7]

  safetail [7,8]

  :type safetail    
#+end_src

#+RESULTS:
: []
: []
: [8]
: safetail :: [a] -> [a]
** 4
#+begin_src haskell
  True  || True  = True
  False || True  = True
  True  || False = True
  False || False = False
#+end_src

#+begin_src haskell
  True || _    = True
  _    || True = True
  _    || _    = False
#+end_src

#+begin_src haskell
  False ||     b = b
  b     || False = b
#+end_src

#+begin_src haskell
  b || c | b == False = c
         | otherwise  = True
#+end_src

#+begin_src haskell :results output
  :{
  True  % True  = True
  False % True  = True
  True  % False = True
  False % False = False
  :}

  True % False
  False % False
#+end_src

#+RESULTS:
: True
: False
** 5
#+begin_src haskell :results output
  a % b = if a then b else if b then a else False

  True % True
  True % False
  False % True
  False % False
#+end_src

#+RESULTS:
: True
: False
: False
: False
** 6
#+begin_src haskell :results output
n  a % b = if a then b else False

  True % True
  True % False
  False % True
  False % False
#+end_src

#+RESULTS:
: True
: False
: False
: False
** 7
#+begin_src haskell :results output
  :{
  mult :: Int -> Int -> Int -> Int
  mult = \x -> (\y -> (\z -> x*y*z))
  :}

  mult 2 3 4
#+end_src

#+RESULTS:
: 24
** 8
#+begin_src haskell :results output
  :{
  decimalDigits n | n == 0    = 1
                  | otherwise = floor (1 + (logBase 10 (abs n)))
  :}

  decimalDigits 1234
  :type decimalDigits
#+end_src

#+RESULTS:
: 4
: decimalDigits
:   :: (RealFrac a1, Integral a2, Floating a1) => a1 -> a2

#+begin_src haskell :results output
  luhnDouble n = let twon = (2 * n) in if twon > 9 then twon - 9 else twon

  luhnDouble 3

  luhnDouble 6
#+end_src

#+RESULTS:
: 6
: 3

#+begin_src haskell :results output
  luhnDouble n = let twon = (2 * n) in if twon > 9 then twon - 9 else twon
    
  luhn a b c d = sum [luhnDouble a, b, luhnDouble c, d] `mod` 10 == 0

  luhn 1 7 8 4

  luhn 4 7 8 3

  :type luhn
#+end_src

#+RESULTS:
: True
: False
: luhn :: Integral a => a -> a -> a -> a -> Bool

* chapter 5
** 1
#+begin_src haskell :results output
  sum [x^2 | x <- [1..100]]
#+end_src

#+RESULTS:
: 338350
** 2
#+name: grid
#+begin_src haskell :results output
  :{
  grid :: Int -> Int -> [(Int, Int)]
  grid x y = [(x', y') | x' <- [0..x], y' <- [0..y]]
  :}

  grid 1 2
#+end_src

#+RESULTS:
: [(0,0),(0,1),(0,2),(1,0),(1,1),(1,2)]
** 3
#+begin_src haskell :results output :noweb yes
  <<grid>>
  square n = [(x, y) | (x, y) <- grid n n, x /= y]

  square 2
#+end_src

#+RESULTS:
: [(0,0),(0,1),(0,2),(1,0),(1,1),(1,2)]
: [(0,1),(0,2),(1,0),(1,2),(2,0),(2,1)]
** 4
#+begin_src haskell :results output
  replicate n e = [e | _ <- [1..n]]

  replicate 3 True
#+end_src

#+RESULTS:
: [True,True,True]
** 5
#+begin_src haskell :results output
  :{
  pyths :: Int -> [(Int,Int,Int)]
  pyths n = [(x,y,z) | x <- xs, y <- xs, z <- xs, x^2 + y^2 == z^2]
             where xs = [1..n]
  :}

  pyths 10
#+end_src

#+RESULTS:
: [(3,4,5),(4,3,5),(6,8,10),(8,6,10)]
** 6
#+begin_src haskell :results output
  factors n = [x | x <- [1..n], n `mod` x == 0]

  perfect n = n == (sum (init (factors n)))

  perfects n = [x | x <- [1..n], perfect x]

  perfects 500
#+end_src

#+RESULTS:
: [6,28,496]
** 7
#+begin_src haskell :results output
  [(x,y) | x <- [1,2], y <- [3, 4]]
#+end_src

#+RESULTS:
: [(1,3),(1,4),(2,3),(2,4)]
?
** 8
#+begin_src haskell :results output
  find k t = [v | (k',v) <- t, k == k']

  -- positions x xs = [i | (x',i) <- zip xs [0..], x == 'x]

  positions x xs = find x (zip xs [0..])

  positions False [True, False, True, False]

#+end_src

#+RESULTS:
: [1,3]

** 9
#+begin_src haskell :results output
  scalarproduct xs ys = sum [x * y | (x, y) <- zip xs ys]

  scalarproduct [1,2,3] [4,5,6]
#+end_src

#+RESULTS:
: 32

* chapter 6
** 2
#+begin_src haskell :results output
  :{
  sumDown 0 = 0
  sumDown n = n + sumDown (n - 1)
  :}

  sumDown 3
#+end_src

#+RESULTS:
: 6
** 3
#+begin_src haskell :results output
  :{
  a % 1 = a
  a % b = a * (a % (b - 1))
  :}

  2 % 10
  2 % 3
#+end_src

#+RESULTS:
: 1024
: 8

#+begin_example
  2 % 3
=   { applying % }
  2 * ( 2 % 2 )
=   { applying % }
  2 * ( 2 * ( 2 % 1 ))
=   { applying % }
  2 * ( 2 * ( 2 ))
=   { applying * }
  2 * ( 4 )
=   { applying * }
  8
#+end_example
** 4
#+begin_src haskell :results output
  :{
  euclid a b | a == b    = a
             | a < b     = euclid a (b - a)
             | otherwise = euclid (a - b) b
  :}

  euclid 6 27
#+end_src

#+RESULTS:
: 3
** 6
*** a
#+begin_src haskell :results output
  :{
  and [x]    = x
  and (x:xs) = x && and xs
  :}

  and [True, True, True]
  and [True, True, False]
#+end_src

#+RESULTS:
: True
: False
*** b
#+begin_src haskell :results output
  :{
  concat []     = []
  concat (x:xs) = x ++ concat xs
  :}

  concat [[1,2],[3,4]]
#+end_src

#+RESULTS:
: [1,2,3,4]
*** c
#+begin_src haskell :results output
  :{
  replicate 0 a = []
  replicate n a = [a] ++ replicate (n - 1) a
  :}

  replicate 10 'a'
#+end_src

#+RESULTS:
: aaaaaaaaaa
*** e
#+begin_src haskell :results output
  :{
  elem e []     = False
  elem e (x:xs) = e == x || elem e xs
  :}

  elem 5 [1..10]
  elem 6 [1..5]
#+end_src

#+RESULTS:
: True
: False
** 7
#+begin_src haskell :results output
  :{
  merge []     []     = []
  merge []     (y:ys) = (y:ys)
  merge (x:xs) []     = (x:xs)
  merge (x:xs) (y:ys) | x <= y    = [x,y] ++ merge xs ys
                      | otherwise = [y,x] ++ merge xs ys
  :}

  merge [2,5,6] [1,3,4]
#+end_src

#+RESULTS:
: [1,2,3,5,4,6]
** 8
#+begin_src haskell :results output
  :{
  merge []     []     = []
  merge []     (y:ys) = (y:ys)
  merge (x:xs) []     = (x:xs)
  merge (x:xs) (y:ys) | x <= y    = [x] ++ merge xs (y:ys) -- !
                      | otherwise = [y] ++ merge (x:xs) ys -- !
  :}

  :{
  halve lst = (take l lst, drop l lst)
    where l = (length lst) `div` 2
  :}

  :{
  msort []  = []
  msort [x] = [x]
  msort lst = merge (msort a) (msort b)
    where
      (a,b) = halve lst
  :}

  merge [6] [3]
  msort (reverse [1..10])
#+end_src

#+RESULTS:
: [3,6]
: [1,2,3,4,5,6,7,8,9,10]

Had to look merge sort on Wikipedia.
** 9
*** c
#+begin_src haskell :results output
  -- 1
  -- last :: [a] -> a
  -- 2,3,4,5
  :{
  last [a]    = a
  last (a:ax) = last ax
  :}

  last [1..10]
#+end_src

#+RESULTS:
: 10

* chapter 7

** 1
#+begin_src haskell :results output
  mapFilter f p lst = [f x | x <- lst, p x]

  mapFilter' f p lst = map f (filter p lst)

  mapFilter (1+) odd [1..10] == mapFilter' (1+) odd [1..10]
#+end_src

#+RESULTS:
: True

** 2

*** d
#+begin_src haskell :results output
  :{
  myDropWhile p []  = []
  myDropWhile p (x:xs) | p x       = myDropWhile p xs
                       | otherwise = (x:xs)
  :}

  myDropWhile odd [1,3,5,7,8,9,10]
#+end_src

#+RESULTS:
: [8,9,10]

** 3
#+begin_src haskell :results output
  myMap f lst = foldr ((:) . f) [] lst
  myMap (2*) [1..10] == map (2*) [1..10]

  myFilter p lst = foldr (\y -> \z -> if p y then y:z else z) [] lst
  myFilter odd [1..10] == filter odd [1..10]
#+end_src

#+RESULTS:
: True
: True

** 4
#+begin_src haskell :results output
  dec2int lst = foldl (\y z -> y*10+z) 0 lst

  dec2int [2,3,4,5]
#+end_src

#+RESULTS:
: 2345

** 5
#+begin_src haskell :results output
  myCurry f = \x y -> f (x, y)
  myUncurry f = \(x, y) -> f x y

  myCurry (\(x, y) -> x + y) 1 2
  myUncurry (+) (1,2)
#+end_src

#+RESULTS:
: 3
: 3

** 9
#+begin_src haskell :results output
  :{
  altMap f g []     = []
  altMap f g (x:xs) = f x : altMap g f xs
  :}

  altMap (+10) (+100) [0,1,2,3,4]
#+end_src

#+RESULTS:
: [10,101,12,103,14]
